In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('https://bit.ly/3kGDuKx', na_values='?')

In [4]:
df.sample(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
515,2,1,"Navratil, Master. Michel M",male,3.0,1,1,230080,26.0000,F2,S,D,NaN,"Nice, France"
995,3,0,"Markoff, Mr. Marin",male,35.0,0,0,349213,7.8958,NaN,C,NaN,NaN,NaN
1134,3,0,"Pokrnic, Mr. Tome",male,24.0,0,0,315092,8.6625,NaN,S,NaN,NaN,NaN

In [5]:
df.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

## 1 gruppo 1 colonna

In [6]:
df.groupby(['pclass'])['survived'].sum() # dataset ridotto con groupby

pclass
1    200
2    119
3    181
Name: survived, dtype: int64

## 1 gruppo 2 colonne

In [27]:
group = df.groupby(['pclass'])[['survived', 'fare']].sum() # dataset ridotto con groupby
group

        survived        fare
pclass
1            200  28265.4043
2            119   5866.6374
3            181   9418.4452

### versione NO as_index

In [8]:
df.groupby(['pclass', 'sex'], as_index=False)['survived'].sum()

   pclass     sex  survived
0       1  female       139
1       1    male        61
2       2  female        94
3       2    male        25
4       3  female       106
5       3    male        75

### versione standard

### Usare  +1  funzione per aggragare valori

In [9]:
df.groupby(['pclass', 'sex'])['survived'].sum()

pclass  sex
1       female    139
        male       61
2       female     94
        male       25
3       female    106
        male       75
Name: survived, dtype: int64

In [26]:
df.groupby(['pclass', 'sex'])['survived'].sum()

pclass  sex
1       female    139
        male       61
2       female     94
        male       25
3       female    106
        male       75
Name: survived, dtype: int64

## Classi di range per categorie numeriche

In [11]:
df['age_bins'] = pd.cut(df['age'], bins=3, labels=('young', 'mid-age', 'old'))

In [13]:
gr_bin = df.groupby(['age_bins'])['survived'].sum()
gr_bin

age_bins
young      199
mid-age    200
old         28
Name: survived, dtype: int64